# GetFormattedText Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
TextNode..::..GetFormattedText Method
TextNode Class See Also
---
Returns an FormattedText object that contains text and associated formatting of this TextNode.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public FormattedText GetFormattedText()
```

Visual Basic
---
```text
Public Function GetFormattedText As FormattedText
```

Visual C++
---
```text
public:
FormattedText^ GetFormattedText()
```

# ### Return Value
The object that contains the text and associated formatting of of the text in this text note.
# See Also
TextNode Class
Autodesk.Revit.DB Namespace